Kozurofu-San/kozurofu-drivers/platforms/STM32F4/UsbCdcOnlyDriver.h
            if (epNums & (Ep1Mask << USB_OTG_DAINT_OEPINT_Pos))
            {
                uint32_t intr = epOut(Ep1)->DOEPINT;
                printf("\nO1(%04X)", (unsigned int)intr);
                if (intr & USB_OTG_DOEPINT_XFRC)
                {
                    transferRxCallback(Ep1);
                    epOut(Ep1)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;  // CNAK and EPENA must be set again after every interrupt to let this EP recieve upcoming data
                }
                epOut(Ep1)->DOEPINT = intr;
            }
            
            return;
        }

        // RX FIFO not empty
        if (_usb->GINTSTS & USB_OTG_GINTSTS_RXFLVL)
        {
            uint32_t status = _usb->GRXSTSP;   // Read out packet status

            if ((status & USB_OTG_GRXSTSP_PKTSTS) ==  StsDataUpdt)      // 0010: OUT data packet received
            {
                printf("\n%d d", cnt++); 
                if (status & USB_OTG_GRXSTSP_BCNT)     // Byte count > 0
                {
                    uint16_t length = (status & USB_OTG_GRXSTSP_BCNT) >> USB_OTG_GRXSTSP_BCNT_Pos;
                    uint8_t EpNum =	(status & USB_OTG_GRXSTSP_EPNUM) >> USB_OTG_GRXSTSP_EPNUM_Pos;
                    readFifo(EpNum, length);   //  Read data from DFIFO
                }
            }
            else if ((status & USB_OTG_GRXSTSP_PKTSTS) ==  StsSetupUpdt)  // 0110: SETUP data packet received
            {
                // Read FFIO
                setup_pkt_data.rawData[0] = *fifo(0);
                setup_pkt_data.rawData[1] = *fifo(0);
            }
            printf("\n"); 
            return;
        }
    }
    
    bool write(uint8_t *data, size_t len) override   // Write to host
    {
        if (!(device_state & DEVICE_STATE_TX_PR) &&
            !(epIn(Ep1)->DIEPTSIZ & USB_OTG_DIEPTSIZ_XFRSIZ) &&
            ((epIn(Ep1)->DIEPTSIZ & USB_OTG_HCTSIZ_PKTCNT) == 0) &&
            !(epIn(Ep1)->DIEPCTL & USB_OTG_DIEPCTL_EPENA)  &&
            ((epIn(Ep1)->DIEPINT & USB_OTG_DIEPINT_TXFE) != 0))
        {
            setTxBuffer(Ep1, data, len);
            return EpOk;
        }
        else return EpFailed;
    }
    
    bool read(uint8_t *data, size_t len) override  // CDC loopback echo
    {
        write(data, len);
        return true;
    }

    void setCallback(void (*cb)(uint32_t)) override
    {
        _cb = cb;
    }

    void setBuffer(uint8_t *buffer, size_t size) override
    {
        _buffer = buffer;
        _bufferSize = size;
    }
    
    inline bool isInit() override { return _isInit; }
    inline uint32_t getSpeed() const override { return _speed; }

    USB_OTG_GlobalTypeDef* getUsb() { return _usb; }
    
    private:

    USB_OTG_GlobalTypeDef   *_usb = USB_OTG_FS;
    USB_OTG_DeviceTypeDef   *_dev = reinterpret_cast<USB_OTG_DeviceTypeDef*>(USB_OTG_FS_PERIPH_BASE + USB_OTG_DEVICE_BASE);
    USB_OTG_HostTypeDef     *_host = reinterpret_cast<USB_OTG_HostTypeDef*>(USB_OTG_FS_PERIPH_BASE + USB_OTG_HOST_BASE);
    __IO uint32_t           *_pwr = reinterpret_cast<__IO uint32_t*>(USB_OTG_FS_PERIPH_BASE + USB_OTG_PCGCCTL_BASE);

    void (*_cb)(uint32_t) = nullptr;
    uint8_t *_buffer = nullptr;
    size_t _bufferSize = 0;

    uint32_t _speed = 0;
    bool _isInit = false;
    
    void sendZlp(uint8_t EPnum)
    {
        epIn(EPnum)->DIEPTSIZ = 1 << USB_OTG_DIEPTSIZ_PKTCNT_Pos   // One Packet
            | 0 << USB_OTG_DIEPTSIZ_XFRSIZ_Pos;          // Zero Length
        epIn(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;
    
        epOut(EPnum)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;
        while (epIn(EPnum)->DIEPTSIZ);  // Make sure zlp is gone
        printf(" z");
    
        device_state &= ~DEVICE_STATE_TX_PR;
    
        EndPoint[EPnum].statusTx = EpReady;
        epIn(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;
    }
    
    void readFifo(uint8_t dfifo, uint16_t len)
    {
        uint16_t residue = (len % sizeof(uint32_t)) ? 1 : 0;
        uint32_t block_cnt = (len / sizeof(uint32_t)) + residue;
        uint8_t *tmp_ptr = EndPoint[dfifo].rxBufferPtr;
    
        // If unprocessed data length exceeds Max buffer length, it has to be rewritten
        if (dfifo && ((EndPoint[dfifo].rxCounter + len) > MaxPacketSize))
        {
            EndPoint[dfifo].rxBufferPtr = rxBufferEp1;
            EndPoint[dfifo].rxCounter = 0;
        }

        uint32_t *ptr = reinterpret_cast<uint32_t *>(EndPoint[dfifo].rxBufferPtr);
        for (uint32_t i = 0; i < block_cnt; i++)
        {
            *ptr++ = *fifo(0);
            printf(" r%08X", (unsigned int)*ptr);
        }
    
        if (dfifo > 0)
        {
            epOut(dfifo)->DOEPTSIZ |= DoeptTransferPct << USB_OTG_DOEPTSIZ_PKTCNT_Pos
                | DoeptTransferSize << USB_OTG_DOEPTSIZ_XFRSIZ_Pos;
            epOut(dfifo)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);
            EndPoint[dfifo].rxBufferPtr = tmp_ptr + len;
            EndPoint[dfifo].rxCounter = EndPoint[dfifo].rxCounter + len;
        }
    }
    
    uint32_t writeFifo(uint8_t dfifo, uint8_t *src, uint16_t len)
    {
        uint16_t residue = (len % sizeof(uint32_t)) ? 1 : 0;
        uint32_t block_cnt = (len / sizeof(uint32_t)) + residue;
        
        uint32_t *ptr = reinterpret_cast<uint32_t *>(src);
        for (uint32_t i = 0; (i < block_cnt) ; i++)
        {
            printf(" w%08X", (unsigned int)*ptr);
            *fifo(dfifo) = *ptr++;
        }

        EndPoint[dfifo].txBufferPtr = EndPoint[dfifo].txBufferPtr + len;
        EndPoint[dfifo].txCounter = EndPoint[dfifo].txCounter - len;

        return 0;
    }
    
    uint32_t transferTxCallback(uint8_t EPnum)
    {
        if (EndPoint[EPnum].statusTx == EpBusy)
        {
            epOut(EPnum)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;
            return EpFailed;
        }

        if (!EndPoint[EPnum].txCounter)        // No data in TX Buffer
        {
            if (EndPoint[EPnum].statusTx == EpZlp)
            {
                sendZlp(EPnum);
                return EpOk;
            }
            epOut(EPnum)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;
            device_state &= ~DEVICE_STATE_TX_PR;
            EndPoint[EPnum].statusTx = EpReady;
            epIn(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_SNAK;
            return EpOk;
        }
    
        uint16_t max_tx_sz = (EPnum == 0) ? MaxCdcEp0TxSiz : MaxCdcEp1TxSiz; // Max transfer size considering TX FIFO size

        uint32_t len = (EndPoint[EPnum].txCounter > max_tx_sz) ? max_tx_sz : EndPoint[EPnum].txCounter;
        uint32_t residue = (len % MaxPacketSize) ? 1 : 0;
        uint32_t pct_cnt = len / MaxPacketSize + residue;

        EndPoint[EPnum].statusTx = EpBusy;      // Set Busy flag

        epIn(EPnum)->DIEPTSIZ = pct_cnt << USB_OTG_DIEPTSIZ_PKTCNT_Pos
            | len << USB_OTG_DIEPTSIZ_XFRSIZ_Pos;
        epIn(EPnum)->DIEPCTL |= USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA;
        
        writeFifo(EPnum, EndPoint[EPnum].txBufferPtr, len);

        if (!EndPoint[EPnum].txCounter && !residue)  // Was this packet of MaxSize the last one in the queue ? Is ZLP required?
        {
            EndPoint[EPnum].statusTx = EpZlp;        // Change EP TX status to ZLP, thereafter ZLP will be sent in sequential function call
            device_state &= ~DEVICE_STATE_TX_PR;
            return EpOk;
        }

