Kozurofu-San/kozurofu-drivers/platforms/STM32F4/UsbCdcOnlyDriver.h
        epOut(EPnum)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;  // Finish transmission
        EndPoint[EPnum].statusTx = EpReady;
        device_state &= ~DEVICE_STATE_TX_PR;

        return EpOk;
    }
    
    
    uint32_t setTxBuffer(uint8_t EPnum, uint8_t *txBuff, uint16_t len)
    {
        if (EndPoint[EPnum].txCounter || (EndPoint[EPnum].statusTx == EpZlp) || (device_state & DEVICE_STATE_TX_PR))
        {
            return EpFailed;    // Previous transaction is not finished
        }
    
        uint32_t max_transfer_sz = MaxPacketSize - 1;
        max_transfer_sz += (EPnum == 0) ? MaxCdcEp0TxSiz : MaxCdcEp1TxSiz;
        if (len > max_transfer_sz) return EpFailed;
        
        if (len)
        {
            EndPoint[EPnum].txBufferPtr = txBuff;
            EndPoint[EPnum].txCounter = len;
            device_state |= DEVICE_STATE_TX_PR;
            transferTxCallback(EPnum);  // Send data
            
            return EpOk;
        }
        
        else    // ZLP
        {
            sendZlp(EPnum);
            return EpOk;
        }
    }

    void transferRxCallback(uint8_t EPnum)
    {
        if (EndPoint[EPnum].statusRx == EpBusy) return;
        uint16_t len = EndPoint[EPnum].rxCounter;
        
        EndPoint[EPnum].rxBufferPtr -= EndPoint[EPnum].rxCounter;      // Reset RX counter and buffer pointer
        EndPoint[EPnum].rxCounter = 0;
        
        _cb(len);
    
        epOut(EPnum)->DOEPTSIZ = DoeptTransferPct << USB_OTG_DOEPTSIZ_PKTCNT_Pos
            | len << USB_OTG_DOEPTSIZ_XFRSIZ_Pos;
        epOut(EPnum)->DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;
    }
    
    void enumerateReset()
    {
        device_state = DEVICE_STATE_RESET;
        _usb->GINTSTS &= ~0xFFFFFFFF;
        
        _dev->DAINTMSK =
            (Ep0Mask | Ep1Mask) << USB_OTG_DAINTMSK_IEPM_Pos |
            (Ep0Mask | Ep1Mask) << USB_OTG_DAINTMSK_OEPM_Pos ;

        _dev->DOEPMSK = USB_OTG_DOEPMSK_STUPM | USB_OTG_DOEPMSK_XFRCM;  // Unmask SETUP Phase done Mask, Transfer Completed interrupt for OUT
        _dev->DIEPMSK = USB_OTG_DIEPMSK_XFRCM;                          // TransfeR Completed interrupt for IN
        _dev->DCFG &= ~USB_OTG_DCFG_DAD_Msk;                            // Before Enumeration set address 0
    
        // CDC
        epIn(Ep1)->DIEPCTL =
            USB_OTG_DIEPCTL_SNAK            |   // Set NAK
            1 << USB_OTG_DIEPCTL_TXFNUM_Pos |   // TX Number 1
            2 << USB_OTG_DIEPCTL_EPTYP_Pos  |   // Eptype 10 - Bulk
            USB_OTG_DIEPCTL_USBAEP          |   // Set Endpoint active
            MaxPacketSize;                      // Max Packet size (bytes)
        
        epOut(Ep1)->DOEPCTL =
            USB_OTG_DOEPCTL_EPENA           |   // Enable Endpoint
            USB_OTG_DOEPCTL_CNAK            |   // Clear NAK
            2 << USB_OTG_DOEPCTL_EPTYP_Pos  |   // Eptype 10 - Bulk
            USB_OTG_DOEPCTL_USBAEP          |   // Set Endpoint active
            MaxPacketSize;                      // MPSIZ The application must program this field with the maximum packet size for the current logical endpoint. This value is in bytes
    	
        epOut(Ep1)->DOEPTSIZ = DoeptTransferPct << USB_OTG_DOEPTSIZ_PKTCNT_Pos  // RM quote: Indicates the total number of USB packets that constitute the Transfer Size amount of data for this endpoint. This field is decremented every time a packet (maximum size or short packet) is written to the RxFIFO
            | DoeptTransferSize << USB_OTG_DOEPTSIZ_XFRSIZ_Pos;                 // Transfer size. If you set transfer size = max. packet, the core will interrupt the application at the end of each packet
    
        // CDC Interrupt
        epIn(Ep2)->DIEPCTL =
            USB_OTG_DIEPCTL_SNAK            |
            2 << USB_OTG_DIEPCTL_TXFNUM_Pos |
            3 << USB_OTG_DIEPCTL_EPTYP_Pos  |     // Eptype 11 - Interrupt EP 
            USB_OTG_DIEPCTL_USBAEP          |
            8 << USB_OTG_DIEPCTL_MPSIZ_Pos  ;

        // MSC
        epOut(Ep2)->DOEPCTL =
            USB_OTG_DOEPCTL_EPENA           |   // Enable Endpoint
            USB_OTG_DOEPCTL_CNAK            |   // Clear NAK
            2 << USB_OTG_DOEPCTL_EPTYP_Pos  |   // Eptype 10 means Bulk
            USB_OTG_DOEPCTL_USBAEP          |   // Set Endpoint active
            MaxPacketSize;                      // Size (bytes)
        
        epOut(Ep2)->DOEPTSIZ = DoeptTransferPct << USB_OTG_DOEPTSIZ_PKTCNT_Pos
            | DoeptTransferSize << USB_OTG_DOEPTSIZ_XFRSIZ_Pos;
        
        epIn(Ep3)->DIEPCTL =
            USB_OTG_DIEPCTL_SNAK            |   // Set NAK
            3 << USB_OTG_DIEPCTL_TXFNUM_Pos |   // TX Number 3
            2 << USB_OTG_DIEPCTL_EPTYP_Pos  |   // Eptype 10 - Bulk
            USB_OTG_DIEPCTL_USBAEP          |   // Set Endpoint active
            MaxPacketSize;                      // Max Packet size (bytes)
                // epIn(Ep3)->DIEPTSIZ = 1 << USB_OTG_DIEPTSIZ_PKTCNT_Pos;
                // epIn(Ep3)->DIEPCTL |= USB_OTG_DIEPCTL_EPENA | USB_OTG_DIEPCTL_CNAK;
    }
    
    void enumerateSetup()
    {
        uint16_t len = setup_pkt_data.setupPacket.wLength;
        uint8_t *ptr = rxBufferEp1;
        printf(" s%04Xv%04X[%d]", setup_pkt_data.setupPacket.wRequest, setup_pkt_data.setupPacket.wValue, len);
        switch(setup_pkt_data.setupPacket.wRequest)
        {
            case ReqTypeHostToDeviceGetDeviceDecriptor:
                switch(setup_pkt_data.setupPacket.wValue)
                {
                    case DescriptorTypeDevice:                  // Request 0x0680  Value 0x0100 
                        if(DeviceDescriptorLength < len) len = DeviceDescriptorLength;
                        ptr = const_cast<uint8_t*>(deviceDescriptor);
                        break;
                    case DescriptorTypeConfiguration:           // Request 0x0680  Value 0x0200
                        if(ConfigurationDescriptorLength < len) len = ConfigurationDescriptorLength;
                        ptr = const_cast<uint8_t*>(configurationDescriptor);
                        break;
                    case DescriptorTypeDeviceQualifier:         // Request 0x0680  Value 0x0600
                        if(DeviceQualifierLength < len) len = DeviceQualifierLength; 
                        ptr = const_cast<uint8_t*>(deviceQualifierDescriptor);
                        break;
                    case DescriptorTypeLangString:              // Request 0x0680  Value 0x0300
                        if(LangDescriptorLength < len) len = LangDescriptorLength;   
                        ptr = const_cast<uint8_t*>(languageStringDescriptor);
                        break;
                    case DescriptorTypeMfcString:               // Request 0x0680  Value 0x0301
                        if(MfcDescriptorLength < len) len = MfcDescriptorLength;
                        ptr = const_cast<uint8_t*>(manufactorStringDescriptor);
                        break;
                    case DescriptorTypeProdString:              // Request 0x0680  Value 0x0302
                        if(ProductDescriptorLength < len) len = ProductDescriptorLength;
                        ptr = const_cast<uint8_t*>(productStringDescriptor);
                        break;
                    case DescriptorTypeSerialString:            // Request 0x0680  Value 0x0303
                        if(SerialDescriptorLength < len) len = SerialDescriptorLength;
                        ptr = const_cast<uint8_t*>(serialNumberStringDescriptor);
                        break;
                    case DescriptorTypeConfigurationString:     // Request 0x0680  Value 0x0304
                        if(ConfigStringLength < len) len = ConfigStringLength;
                        ptr = const_cast<uint8_t*>(configurationStringDescriptor);
                        break;
                    case DescriptorTypeInterfaceString:         // Request 0x0680  Value 0x0305
                        if(InterfaceStringLength < len) len = InterfaceStringLength;
                        ptr = const_cast<uint8_t*>(stringInterface);
                        break;
                    default:
                        return;
                }
                break;
                
            case ReqTypeDeviceToHostSetAddress:                 // Request 0x0500
                _dev->DCFG |= setup_pkt_data.setupPacket.wValue << 4;
                device_state |= DEVICE_STATE_ADDRESSED;
                break;
            case ReqTypeDeviceToHostSetConfiguration:           // Request 0x0900
                len = 0;    // ZLP
                // TODO: set configuration
                break;
            
            // CDC
            case CdcGetLineCoding:                              // Request 0x21A1
                if (CdcLineCodingLength < len) len = CdcLineCodingLength;
                // ptr = const_cast<uint8_t*>(lineCoding);
                // device_state |= DEVICE_STATE_LINECODED;
                break;
            
