Kozurofu-San/kozurofu-drivers/platforms/STM32F4/UsbCdcOnlyDriver.h
            case CdcSetLineCoding:                              // Request 0x2021
                len = 0;
                break;
            case CdcSetControlLineState:                        // Request 0x2221
                len = 0;
                break;
            case ClearFeatureEndp:                              // Request 0x0201
                return;

            // MSC
            case MscBulkOnlyReset:                              // Request 0xFF21
                _usb->GRSTCTL = (2 << USB_OTG_GRSTCTL_TXFNUM_Pos) | USB_OTG_GRSTCTL_TXFFLSH;   // Flush TX FIFO
                while (USB_OTG_FS->GRSTCTL & USB_OTG_GRSTCTL_TXFFLSH);
                len = 0;
                break;
            case MscGetMaxLun:                                  // Request 0xFEA1
                if (1 < len) len = 1;
                static uint8_t maxLun = 1;
                ptr = const_cast<uint8_t*>(&maxLun);
                break;

            default:
                break;
        } 
        
        setTxBuffer(Ep0, ptr, len);
    }
    
    static constexpr uint32_t Ep0 = 0;
    static constexpr uint32_t Ep1 = 1;
    static constexpr uint32_t Ep2 = 2;
    static constexpr uint32_t Ep3 = 3;
    
    static constexpr uint32_t Ep0Mask = 1 << Ep0;
    static constexpr uint32_t Ep1Mask = 1 << Ep1;
    static constexpr uint32_t Ep2Mask = 1 << Ep2;
    static constexpr uint32_t Ep3Mask = 1 << Ep3;

    static constexpr uint8_t MaxPacketSize      = 64;
    static constexpr uint8_t CdcCmdPacketSize   = 8;
    static constexpr uint8_t Ep0Size            = 64;
    static constexpr uint8_t EpCount            = 3;

    static constexpr uint16_t Vid = 0x0483;
    static constexpr uint16_t Pid = 0x5740;

    static constexpr uint16_t LangIdString = 1033;

    static constexpr uint8_t DeviceDescriptorLength         = 18;
    static constexpr uint8_t ConfigurationDescriptorLength  = 67 + 0*23;
    static constexpr uint8_t LangDescriptorLength           = 4;
    static constexpr uint8_t MfcDescriptorLength            = 38;
    static constexpr uint8_t ProductDescriptorLength        = 44;
    static constexpr uint8_t SerialDescriptorLength         = 26;
    static constexpr uint8_t DeviceQualifierLength          = 10;
    static constexpr uint8_t InterfaceStringLength          = 28;
    static constexpr uint8_t ConfigStringLength             = 22;
    static constexpr uint8_t CdcLineCodingLength            = 7;

    static constexpr uint16_t RxFifoSize        = 36;
    static constexpr uint16_t TxEp0FifoSize     = 16;
    static constexpr uint16_t TxEp1FifoSize     = 320 - (RxFifoSize + TxEp0FifoSize);
    static constexpr uint16_t TxEp2FifoSize     = 0;
    static constexpr uint16_t TxEp3FifoSize     = 0;
    static constexpr uint16_t MaxCdcEp0TxSiz    = 64;
    static constexpr uint16_t MaxCdcEp1TxSiz    = 256;
    static constexpr uint8_t DoeptTransferSize  = 0x40;
    static constexpr uint8_t DoeptTransferPct   = 0x01;

    static constexpr uint8_t EpReady    = 0;
    static constexpr uint8_t EpBusy     = 1;
    static constexpr uint8_t EpZlp      = 2;

    static constexpr uint8_t EpOk       = 1;
    static constexpr uint8_t EpFailed   = 0;

    static constexpr uint16_t ReqTypeHostToDeviceGetDeviceDecriptor = 0x0680;
    static constexpr uint16_t ReqTypeDeviceToHostSetAddress         = 0x0500;
    static constexpr uint16_t ReqTypeDeviceToHostSetConfiguration   = 0x0900;
    static constexpr uint16_t DescriptorTypeDevice                  = 0x0100;
    static constexpr uint16_t DescriptorTypeConfiguration           = 0x0200;
    static constexpr uint16_t DescriptorTypeLangString              = 0x0300;
    static constexpr uint16_t DescriptorTypeMfcString               = 0x0301;
    static constexpr uint16_t DescriptorTypeProdString              = 0x0302;
    static constexpr uint16_t DescriptorTypeSerialString            = 0x0303;
    static constexpr uint16_t DescriptorTypeConfigurationString     = 0x0304;
    static constexpr uint16_t DescriptorTypeInterfaceString         = 0x0305;
    static constexpr uint16_t DescriptorTypeDeviceQualifier         = 0x0600;
    static constexpr uint16_t CdcGetLineCoding                      = 0x21A1;
    static constexpr uint16_t CdcSetLineCoding                      = 0x2021;
    static constexpr uint16_t CdcSetControlLineState                = 0x2221;
    static constexpr uint16_t ClearFeatureEndp                      = 0x0102;
    static constexpr uint16_t MscBulkOnlyReset                      = 0xFF21;   // Host-to-Device, Class, Interface
    static constexpr uint16_t MscGetMaxLun                          = 0xFEA1;   // Device-to-Host, Class, Interface


    static constexpr uint32_t StsDataUpdt  = 2 << USB_OTG_GRXSTSP_PKTSTS_Pos;
    static constexpr uint32_t StsSetupUpdt = 6 << USB_OTG_GRXSTSP_PKTSTS_Pos;

    static constexpr uint16_t RxBufferEp0Size = 8;
    
    uint8_t rxBufferEp0[RxBufferEp0Size];
    uint8_t rxBufferEp1[MaxPacketSize];
    uint8_t rxBufferEp2[MaxPacketSize];
    
    typedef enum
    {
        DEVICE_STATE_DEFAULT    = 0,
        DEVICE_STATE_RESET      = 1,
        DEVICE_STATE_ADDRESSED  = 2,
        DEVICE_STATE_LINECODED  = 4,
        DEVICE_STATE_TX_PR      = 8, /* TX transmission active */
    } eDeviceState;
    
    
    static constexpr inline USB_OTG_OUTEndpointTypeDef* epOut(uint32_t i)
    {
        return reinterpret_cast<USB_OTG_OUTEndpointTypeDef*>(
            USB_OTG_FS_PERIPH_BASE + USB_OTG_OUT_ENDPOINT_BASE + (i * USB_OTG_EP_REG_SIZE));
    }
    
    static constexpr inline USB_OTG_INEndpointTypeDef* epIn(uint32_t i)
    {
        return reinterpret_cast<USB_OTG_INEndpointTypeDef*>(
            USB_OTG_FS_PERIPH_BASE + USB_OTG_IN_ENDPOINT_BASE + (i * USB_OTG_EP_REG_SIZE));
    }
    
    static constexpr inline uint32_t* fifo(uint32_t i)
    {
        return reinterpret_cast<uint32_t*>(
            USB_OTG_FS_PERIPH_BASE  + USB_OTG_FIFO_BASE + (i) * USB_OTG_FIFO_SIZE);
    }

    uint8_t lineCoding[7]={
        0x00, 
        0x00,	/* 0x01, */
        0x00, /* 0xC2, */
        0x00, /* 0X0001C200 -= 115200 Kb/s */
        0x00,
        0x00,
        0x00	/* 0x08 */
    };
    
    typedef struct EndPointStruct
    {
        uint16_t statusRx;
        uint16_t statusTx;
    
        uint16_t rxCounter;
        uint16_t txCounter;
        
