Kozurofu-San/kozurofu-drivers/platforms/STM32F4/UsbCdcOnlyDriver.h
        uint8_t *rxBufferPtr;
        uint8_t *txBufferPtr;
    } EndPointStruct;
    EndPointStruct EndPoint[EpCount];	/* All the Enpoints are included in this array */

    typedef struct
    {
        uint16_t  wRequest;
        uint16_t  wValue;
        uint16_t  wIndex;
        uint16_t  wLength;
    } UsbSetupReq;	/* SETUP packet buffer. Always 8 bytes */

    typedef union
    {
        UsbSetupReq setupPacket;
        uint32_t rawData[2];
    } UsbSetupReqData;

    uint32_t device_state = DEVICE_STATE_DEFAULT; /* Device state */

    UsbSetupReqData setup_pkt_data;      // Setup Packet var

    /* Device string descriptor */
    static constexpr uint8_t deviceDescriptor[DeviceDescriptorLength] = {
        DeviceDescriptorLength,     
        0x01,                       /* bDescriptorType: device */
        0x00, 0x02,                 /* bcdUSB  0x0110: usb 1.1 ; 0x0200: usb 2.0 */
        0xEF,                       /* bDeviceClass: Composite */
        0x02,                       /* bDeviceSubClass */
        0x00,                       /* bDeviceProtocol */
        Ep0Size,                    /* bMaxPacketSize0: EP0 size (64 b) */
        loByte(Vid), hiByte(Vid),   /* VID: STM */
        loByte(Pid), hiByte(Pid),   /* PID: STM */
        0x00, 0x01,                 /* bcdDevice Version */
        0x01,                       /* iManufacturer */
        0x02,                       /* iProduct */
        0x03,                       /* iSerial */
        1                           /* bNumConfigurations */
    };

    /* Configuration descriptor */
    static constexpr uint8_t configurationDescriptor[ConfigurationDescriptorLength] = {
        /* Configuration descriptor */
        0x09,                                   /* bLength: Configuration Descriptor size */
        0x02,                                   /* bDescriptorType: Configuration */
        ConfigurationDescriptorLength, 0x00,    /* wTotalLength:no of returned bytes */
        0x02,                                   /* bNumInterfaces: 3 interface */
        0x01,                                   /* bConfigurationValue: Configuration value */
        0x00,                                   /* iConfiguration: Index of string descriptor describing the configuration */
        0xC0,                                   /* bmAttributes: self powered */
        0x32,                                   /* MaxPower 100 mA */
        
        /*Interface Descriptor */
        0x09,           /* bLength: Interface Descriptor size */
        0x04,           /* bDescriptorType: Interface */
        0x00,           /* bInterfaceNumber: Number of Interface */
        0x00,           /* bAlternateSetting: Alternate setting */
        0x01,           /* bNumEndpoints: One endpoints used */
        0x02,           /* bInterfaceClass: Communication Interface Class */
        0x02,           /* bInterfaceSubClass: Abstract Control Model */
        0x01,           /* bInterfaceProtocol: Common AT commands */
        0x00,           /* iInterface: */

        /*Header Functional Descriptor*/
        0x05,           /* bLength: Endpoint Descriptor size */
        0x24,           /* bDescriptorType: CS_INTERFACE */
        0x00,           /* bDescriptorSubtype: Header Func Desc */
        0x10,           /* bcdCDC: spec release number */
        0x01,

        /*Call Management Functional Descriptor*/
        0x05,           /* bFunctionLength */
        0x24,           /* bDescriptorType: CS_INTERFACE */
        0x01,           /* bDescriptorSubtype: Call Management Func Desc */
        0x00,           /* bmCapabilities: D0+D1 */
        0x01,           /* bDataInterface: 1 */

        /*ACM Functional Descriptor*/
        0x04,           /* bFunctionLength */
        0x24,           /* bDescriptorType: CS_INTERFACE */
        0x02,           /* bDescriptorSubtype: Abstract Control Management desc */
        0x02,           /* bmCapabilities */

        /*Union Functional Descriptor*/
        0x05,           /* bFunctionLength */
        0x24,           /* bDescriptorType: CS_INTERFACE */
        0x06,           /* bDescriptorSubtype: Union func desc */
        0x00,           /* bMasterInterface: Communication class interface */
        0x01,           /* bSlaveInterface0: Data Class Interface */

        /*Endpoint 2 Descriptor*/
        0x07,           /* bLength: Endpoint Descriptor size */
        0x05,           /* bDescriptorType: Endpoint */
        0x82,           /* bEndpointAddress */
        0x03,           /* bmAttributes: Interrupt */
        loByte(CdcCmdPacketSize), hiByte(CdcCmdPacketSize),    /* wMaxPacketSize: */
        0x10,           /* bInterval: */

        /*Data class interface descriptor*/
        0x09,           /* bLength: Endpoint Descriptor size */
        0x04,           /* bDescriptorType: Interface */
        0x01,           /* bInterfaceNumber: Number of Interface */
        0x00,           /* bAlternateSetting: Alternate setting */
        0x02,           /* bNumEndpoints: Two endpoints used */
        0x0A,           /* bInterfaceClass: CDC */
        0x00,           /* bInterfaceSubClass: */
        0x00,           /* bInterfaceProtocol: */
        0x00,           /* iInterface: */

        /*Endpoint OUT Descriptor*/
        0x07,           /* bLength: Endpoint Descriptor size */
        0x05,           /* bDescriptorType: Endpoint */
        0x01,           /* bEndpointAddress */
        0x02,           /* bmAttributes: Bulk */
        loByte(MaxPacketSize), hiByte(MaxPacketSize),  /* wMaxPacketSize: */
        0x00,           /* bInterval: ignore for Bulk transfer */

        /*Endpoint IN Descriptor*/
        0x07,           /* bLength: Endpoint Descriptor size */
        0x05,           /* bDescriptorType: Endpoint */
        0x81,           /* bEndpointAddress */
        0x02,           /* bmAttributes: Bulk */
        loByte(MaxPacketSize), hiByte(MaxPacketSize), /* wMaxPacketSize: */
        0x00,           /* bInterval: ignore for Bulk transfer */
        
        // /*Data class interface descriptor*/
        // 0x09,           /* bLength: Endpoint Descriptor size */
        // 0x04,           /* bDescriptorType: Interface */
        // 0x02,           /* bInterfaceNumber: Number of Interface */
        // 0x00,           /* bAlternateSetting: Alternate setting */
        // 0x02,           /* bNumEndpoints: Two endpoints used */
        // 0x08,           /* bInterfaceClass: MSC */
        // 0x06,           /* bInterfaceSubClass: */
        // 0x50,           /* bInterfaceProtocol: */
        // 0x00,           /* iInterface: */
        
        // /*Endpoint OUT Descriptor*/
        // 0x07,           /* bLength: Endpoint Descriptor size */
        // 0x05,           /* bDescriptorType: Endpoint */
        // 0x02,           /* bEndpointAddress */
        // 0x02,           /* bmAttributes: Bulk */
        // loByte(MaxPacketSize), hiByte(MaxPacketSize),  /* wMaxPacketSize: */
        // 0x00,           /* bInterval: ignore for Bulk transfer */

        // /*Endpoint IN Descriptor*/
        // 0x07,           /* bLength: Endpoint Descriptor size */
        // 0x05,           /* bDescriptorType: Endpoint */
        // 0x83,           /* bEndpointAddress */
        // 0x02,           /* bmAttributes: Bulk */
        // loByte(MaxPacketSize), hiByte(MaxPacketSize), /* wMaxPacketSize: */
        // 0x00            /* bInterval: ignore for Bulk transfer */
    };

    /* Language string descriptor */
    static constexpr uint8_t languageStringDescriptor[LangDescriptorLength] = {
        LangDescriptorLength,   /* USB_LEN_LANGID_STR_DESC */
        0x03,                   /* USB_DESC_TYPE_STRING */
        loByte(LangIdString),
        hiByte(LangIdString)
    };

    /* Manufactor string descriptor */
    static constexpr uint8_t manufactorStringDescriptor[MfcDescriptorLength] = {
        MfcDescriptorLength,				 
        0x03,	                /* USB_DESC_TYPE_STRING */
        'S', 0x00,
        'T', 0x00, 
        'M', 0x00, 
        'i', 0x00, 
        'c', 0x00, 
        'r', 0x00, 
        'o', 0x00, 
        'e', 0x00, 
        'l', 0x00, 
        'e', 0x00, 
        'c', 0x00, 
        't', 0x00, 
        'r', 0x00, 
        'o', 0x00,			
        'n', 0x00, 
        'i', 0x00, 
        'c', 0x00, 
        's', 0x00
    };

    /* Product string descriptor */
    static constexpr uint8_t productStringDescriptor[ProductDescriptorLength] = {
        ProductDescriptorLength, 
        0x03,                   /* USB_DESC_TYPE_STRING */
        'G', 0x00, 
        'r', 0x00, 
        'o', 0x00, 
        'u', 0x00, 
        'n', 0x00, 
        'd', 0x00, 
        ' ', 0x00, 
        'P', 0x00, 
        'e', 0x00, 
        'n', 0x00, 
        'e', 0x00, 
        't', 0x00, 
        'r', 0x00, 
        'a', 0x00,
        't', 0x00, 
        ' ', 0x00, 
        'R', 0x00, 
        'a', 0x00, 
        'd', 0x00, 
        'a', 0x00, 
        'r', 0x00
    };

    /* Serial number string descriptor */
    static constexpr uint8_t serialNumberStringDescriptor[SerialDescriptorLength] = {
        SerialDescriptorLength,	 
        0x03,               /* USB_DESC_TYPE_STRING */
        0x34, 0x00,
        0x38, 0x00, 
        0x00, 0x00, 
        0x45, 0x00, 
        0x37, 0x00, 
        0x34, 0x00, 
        0x46, 0x00, 
        0x37, 0x00, 
        0x36, 0x00, 
        0x33, 0x00, 
        0x30, 0x00, 
        0x38, 0x00
    };

    /* Device qualifier string descriptor */
    static constexpr uint8_t deviceQualifierDescriptor[DeviceQualifierLength] = {
        DeviceQualifierLength,
        0x06,               /* Device Qualifier */
        0x00,
        0x02,
        0x00,
        0x00,
        0x00,
        0x40,
        0x01,
        0x00
    };

    static constexpr uint8_t stringInterface[InterfaceStringLength] = {
        InterfaceStringLength, 
        0x03,               /* USB_DESC_TYPE_STRING */
        'C', 0x00, 
        'D', 0x00, 
        'C', 0x00, 
        ' ', 0x00, 
        'I', 0x00, 
        'n', 0x00, 
        't', 0x00, 
        'e', 0x00, 
        'r', 0x00, 
        'f', 0x00, 
        'a', 0x00, 
        'c', 0x00, 
        'e', 0x00
    };

    static constexpr uint8_t configurationStringDescriptor[ConfigStringLength] = {
        ConfigStringLength, 
        0x03,               /* USB_DESC_TYPE_STRING */
        'C', 0x00, 
        'D', 0x00, 
        'C', 0x00, 
        ' ', 0x00, 
        'C', 0x00, 
        'o', 0x00, 
        'n', 0x00, 
        'f', 0x00, 
        'i', 0x00, 
        'g', 0x00
    };

};
}